tiborsimon/embedded-tdd-headers/pic/8bit/pic18f85j94_tdd.h
#define LCDDATA60                     1649
#define S32C7                         1650
#define S33C7                         1651
#define S34C7                         1652
#define S35C7                         1653
#define S36C7                         1654
#define S37C7                         1655
#define S38C7                         1656
#define S39C7                         1657
#define LCDDATA61                     1658
#define S40C7                         1659
#define S41C7                         1660
#define S42C7                         1661
#define S43C7                         1662
#define S44C7                         1663
#define S45C7                         1664
#define S46C7                         1665
#define S47C7                         1666
#define LCDDATA62                     1667
#define S48C7                         1668
#define S49C7                         1669
#define S50C7                         1670
#define S51C7                         1671
#define S52C7                         1672
#define S53C7                         1673
#define S54C7                         1674
#define S55C7                         1675
#define LCDDATA63                     1676
#define S56C7                         1677
#define S57C7                         1678
#define S58C7                         1679
#define S59C7                         1680
#define S60C7                         1681
#define S61C7                         1682
#define S62C7                         1683
#define S63C7                         1684
#define LCDSE0                        1685
#define SE00                          1686
#define SE01                          1687
#define SE02                          1688
#define SE03                          1689
#define SE04                          1690
#define SE05                          1691
#define SE06                          1692
#define SE07                          1693
#define LCDSE1                        1694
#define SE08                          1695
#define SE09                          1696
#define SE10                          1697
#define SE11                          1698
#define SE12                          1699
#define SE13                          1700
#define SE14                          1701
#define SE15                          1702
#define LCDSE2                        1703
#define SE16                          1704
#define SE17                          1705
#define SE18                          1706
#define SE19                          1707
#define SE20                          1708
#define SE21                          1709
#define SE22                          1710
#define SE23                          1711
#define LCDSE3                        1712
#define SE24                          1713
#define SE25                          1714
#define SE26                          1715
#define SE27                          1716
#define SE28                          1717
#define SE29                          1718
#define SE30                          1719
#define SE31                          1720
#define LCDSE4                        1721
#define SE32                          1722
#define SE33                          1723
#define SE34                          1724
#define SE35                          1725
#define SE36                          1726
#define SE37                          1727
#define SE38                          1728
#define SE39                          1729
#define LCDSE5                        1730
#define SE40                          1731
#define SE41                          1732
#define SE42                          1733
#define SE43                          1734
#define SE44                          1735
#define SE45                          1736
#define SE46                          1737
#define SE47                          1738
#define LCDSE6                        1739
#define SE48                          1740
#define SE49                          1741
#define SE50                          1742
#define SE51                          1743
#define SE52                          1744
#define SE53                          1745
#define SE54                          1746
#define SE55                          1747
#define LCDSE7                        1748
#define SE56                          1749
#define SE57                          1750
#define SE58                          1751
#define SE59                          1752
#define SE60                          1753
#define SE61                          1754
#define SE62                          1755
#define SE63                          1756
#define LCDRL                         1757
#define LRLAT0                        1758
#define LRLAT                         1759
#define LRLAT1                        1760
#define LRLAT2                        1761
#define LRLBP                         1762
#define LRLBP0                        1763
#define LRLBP1                        1764
#define LRLAP0                        1765
#define LRLAP                         1766
#define LRLAP1                        1767
#define LCDREF                        1768
#define VLCD1PE                       1769
#define VLCD2PE                       1770
#define VLCD3PE                       1771
#define LCDCST0                       1772
#define LCDCST                        1773
#define LCDCST1                       1774
#define LCDCST2                       1775
#define LCDIRE                        1776
#define LCDREG                        1777
#define CLKSEL                        1778
#define CLKSEL0                       1779
#define CLKSEL1                       1780
#define MODE13                        1781
#define BIAS0                         1782
#define BIAS                          1783
#define BIAS1                         1784
#define BIAS2                         1785
#define CPEN                          1786
#define LCDCON                        1787
#define LMUX0                         1788
#define LMUX                          1789
#define LMUX1                         1790
#define LMUX2                         1791
#define LCDCON_CS                     1792
#define CS0                           1793
#define CS1                           1794
#define WERR                          1795
#define SLPEN                         1796
#define LCDEN                         1797
#define LCDPS                         1798
#define LP                            1799
#define LP0                           1800
#define LP1                           1801
#define LP2                           1802
#define LP3                           1803
#define WA                            1804
#define LCDA                          1805
#define BIASMD                        1806
#define WFT                           1807
#define REFO2CON3                     1808
#define REFO2CON3_RODIV8              1809
#define REFO2CON3_RODIV               1810
#define REFO2CON3_RODIV9              1811
#define REFO2CON3_RODIV10             1812
#define REFO2CON3_RODIV11             1813
#define REFO2CON3_RODIV12             1814
#define REFO2CON3_RODIV13             1815
#define REFO2CON3_RODIV14             1816
#define REFO2CON2                     1817
#define REFO2CON2_RODIV               1818
#define REFO2CON2_RODIV0              1819
#define REFO2CON2_RODIV1              1820
#define REFO2CON2_RODIV2              1821
#define REFO2CON2_RODIV3              1822
#define REFO2CON2_RODIV4              1823
#define REFO2CON2_RODIV5              1824
#define REFO2CON2_RODIV6              1825
#define REFO2CON2_RODIV7              1826
#define REFO2CON1                     1827
#define REFO2CON1_ROSEL               1828
#define REFO2CON1_ROSEL0              1829
#define REFO2CON1_ROSEL1              1830
#define REFO2CON1_ROSEL2              1831
#define REFO2CON1_ROSEL3              1832
#define REFO2CON                      1833
#define REFO2CON_ACTIVE               1834
#define REFO2CON_DIVSWEN              1835
#define REFO2CON_ROSSLP               1836
#define REFO2CON_ROOE                 1837
#define REFO2CON_ROSIDL               1838
#define REFO2CON_ROON                 1839
#define REFO1CON3                     1840
#define REFO1CON3_RODIV8              1841
#define REFO1CON3_RODIV               1842
#define REFO1CON3_RODIV9              1843
#define REFO1CON3_RODIV10             1844
#define REFO1CON3_RODIV11             1845
#define REFO1CON3_RODIV12             1846
#define REFO1CON3_RODIV13             1847
#define REFO1CON3_RODIV14             1848
#define REFO1CON2                     1849
#define REFO1CON2_RODIV               1850
#define REFO1CON2_RODIV0              1851
#define REFO1CON2_RODIV1              1852
#define REFO1CON2_RODIV2              1853
#define REFO1CON2_RODIV3              1854
#define REFO1CON2_RODIV4              1855
#define REFO1CON2_RODIV5              1856
#define REFO1CON2_RODIV6              1857
#define REFO1CON2_RODIV7              1858
#define REFO1CON1                     1859
#define REFO1CON1_ROSEL               1860
#define REFO1CON1_ROSEL0              1861
#define REFO1CON1_ROSEL1              1862
#define REFO1CON1_ROSEL2              1863
#define REFO1CON1_ROSEL3              1864
#define REFO1CON                      1865
#define REFO1CON_ACTIVE               1866
#define REFO1CON_DIVSWEN              1867
#define REFO1CON_ROSSLP               1868
#define REFO1CON_ROOE                 1869
#define REFO1CON_ROSIDL               1870
#define REFO1CON_ROON                 1871
#define MEMCON                        1872
#define MEMCON_WM                     1873
#define MEMCON_WM0                    1874
#define MEMCON_WM1                    1875
#define WAIT0                         1876
#define WAIT                          1877
#define WAIT1                         1878
#define EBDIS                         1879
#define ODCON2                        1880
#define ECCP3OD                       1881
#define CCP4OD                        1882
#define CCP5OD                        1883
#define CCP6OD                        1884
#define CCP7OD                        1885
#define CCP8OD                        1886
#define CCP9OD                        1887
#define CCP10OD                       1888
#define ODCON1                        1889
#define SSP1OD                        1890
#define SSP2OD                        1891
#define USART1OD                      1892
#define USART2OD                      1893
#define USART3OD                      1894
#define USART4OD                      1895
#define ECCP1OD                       1896
#define ECCP2OD                       1897
#define MDCARL                        1898
#define MDCL0                         1899
#define MDCL                          1900
#define MDCL1                         1901
#define MDCL2                         1902
#define MDCL3                         1903
#define MDCLSYNC                      1904
#define MDCLPOL                       1905
#define MDCLODIS                      1906
#define MDCARH                        1907
#define MDCH                          1908
#define MDCH0                         1909
#define MDCH1                         1910
#define MDCH2                         1911
#define MDCH3                         1912
#define MDCHSYNC                      1913
#define MDCHPOL                       1914
#define MDCHODIS                      1915
#define MDSRC                         1916
#define MDSRC0                        1917
#define MDSRC1                        1918
#define MDSRC2                        1919
#define MDSRC3                        1920
#define MDSODIS                       1921
#define MDCON                         1922
#define MDBIT                         1923
#define MDO                           1924
#define MDOPOL                        1925
#define MDSLR                         1926
#define MDOE                          1927
#define MDEN                          1928
#define PMD4                          1929
#define PMD4_EMBMD                    1930
#define LVDMD                         1931
#define IOCMD                         1932
#define USBMD                         1933
#define CMP3MD                        1934
#define CMP2MD                        1935
#define CMP1MD                        1936
#define PMD3                          1937
#define REFO2MD                       1938
#define REFO1MD                       1939
#define PSPMD                         1940
#define LCDMD                         1941
#define RTCCMD                        1942
#define ADCMD                         1943
#define CTMUMD                        1944
#define TXMMD                         1945
#define MODMD                         1946
#define PMD2                          1947
#define TMR0MD                        1948
#define TMR1MD                        1949
#define TMR2MD                        1950
#define TMR3MD                        1951
#define TMR4MD                        1952
#define TMR5MD                        1953
#define TMR6MD                        1954
#define TMR8MD                        1955
#define PMD1                          1956
#define SSP1MD                        1957
#define PMD1_EMBMD                    1958
#define SSP2MD                        1959
#define UART1MD                       1960
#define UART2MD                       1961
#define UART3MD                       1962
#define UART4MD                       1963
#define ECCP1MD                       1964
#define ECCP2MD                       1965
#define PMD0                          1966
#define ECCP3MD                       1967
#define CCP4MD                        1968
#define SPI1MD                        1969
#define SPI2MD                        1970
#define CCP5MD                        1971
#define CCP6MD                        1972
#define CCP7MD                        1973
#define CCP8MD                        1974
#define CCP9MD                        1975
#define CCP10MD                       1976
#define CTMUCON4                      1977
#define EDG1STAT                      1978
#define EDG2STAT                      1979
#define EDG1SEL                       1980
#define EDG1SEL0                      1981
#define EDG1SEL1                      1982
#define EDG1SEL2                      1983
#define EDG1SEL3                      1984
#define EDG1POL                       1985
#define EDG1EN                        1986
#define CTMUCON3                      1987
#define EDG2SEL0                      1988
#define EDG2SEL                       1989
#define EDG2SEL1                      1990
#define EDG2SEL2                      1991
#define EDG2SEL3                      1992
#define EDG2POL                       1993
#define EDG2EN                        1994
#define CTMUCON2                      1995
#define IRNG                          1996
#define IRNG0                         1997
#define IRNG1                         1998
#define ITRIM0                        1999
#define ITRIM                         2000
#define ITRIM1                        2001
#define ITRIM2                        2002
#define ITRIM3                        2003
#define ITRIM4                        2004
#define ITRIM5                        2005
#define CTMUCON1                      2006
#define CTTRIG                        2007
#define IDISSEN                       2008
#define EDGSEQEN                      2009
#define EDGEN                         2010
#define TGEN                          2011
#define CTMUSIDL                      2012
#define CTMUCON1_CTMUEN               2013
#define TXREG4                        2014
#define RCREG4                        2015
#define SPBRG4_BRG0                   2016
#define SPBRG4                        2017
#define SPBRG4_BRG1                   2018
#define SPBRG4_BRG2                   2019
#define SPBRG4_BRG3                   2020
#define SPBRG4_BRG4                   2021
#define SPBRG4_BRG5                   2022
#define SPBRG4_BRG6                   2023
#define SPBRG4_BRG7                   2024
#define SPBRGH4                       2025
#define SPBRGH4_BRG8                  2026
#define SPBRGH4_BRG9                  2027
#define SPBRGH4_BRG10                 2028
#define SPBRGH4_BRG11                 2029
#define SPBRGH4_BRG12                 2030
#define SPBRGH4_BRG13                 2031
#define SPBRGH4_BRG14                 2032
#define SPBRGH4_BRG15                 2033
#define BAUDCON4                      2034
#define BAUDCON4_ABDEN                2035
#define BAUDCON4_WUE                  2036
#define BAUDCON4_IREN                 2037
#define BAUDCON4_BRG16                2038
#define BAUDCON4_TXCKP                2039
#define BAUDCON4_RXDTP                2040
#define BAUDCON4_RCIDL                2041
#define BAUDCON4_ABDOVF               2042
#define TXSTA4                        2043
#define TXSTA4_TX9D                   2044
#define TXSTA4_TRMT                   2045
#define TXSTA4_BRGH                   2046
#define TXSTA4_SENDB                  2047
#define TXSTA4_SYNC                   2048
#define TXSTA4_TXEN                   2049
#define TXSTA4_TX9                    2050
#define TXSTA4_CSRC                   2051
#define RCSTA4                        2052
#define RCSTA4_RX9D                   2053
#define RCSTA4_OERR                   2054
#define RCSTA4_FERR                   2055
#define RCSTA4_ADDEN                  2056
#define RCSTA4_CREN                   2057
#define RCSTA4_SREN                   2058
#define RCSTA4_RX9                    2059
#define RCSTA4_SPEN                   2060
#define DMACON2                       2061
#define INTLVL0                       2062
#define INTLVL                        2063
#define INTLVL1                       2064
#define INTLVL2                       2065
#define INTLVL3                       2066
#define DLYCYC                        2067
#define DLYCYC0                       2068
#define DLYCYC1                       2069
#define DLYCYC2                       2070
#define DLYCYC3                       2071
#define ANCFG                         2072
#define VBGEN                         2073
#define VBG2EN                        2074
#define VBG6EN                        2075
#define SSP2ADD                       2076
#define MSK02                         2077
#define SSP2ADD_SSPADD                2078
#define MSK12                         2079
#define MSK22                         2080
#define MSK32                         2081
#define MSK42                         2082
#define MSK52                         2083
#define MSK62                         2084
#define MSK72                         2085
#define SSP2BUF                       2086
#define SSP2BUF_SSPBUF                2087
#define T4CON                         2088
#define T4CKPS0                       2089
#define T4CKPS                        2090
#define T4CKPS1                       2091
#define TMR4ON                        2092
#define T4OUTPS                       2093
#define T4OUTPS0                      2094
#define T4OUTPS1                      2095
#define T4OUTPS2                      2096
#define T4OUTPS3                      2097
#define PR4                           2098
#define TMR4                          2099
#define CCP7CON                       2100
#define CCP7M0                        2101
#define CCP7M                         2102
#define CCP7M1                        2103
#define CCP7M2                        2104
#define CCP7M3                        2105
#define DC7B                          2106
#define CCP7Y                         2107
#define DC7B0                         2108
#define CCP7X                         2109
#define DC7B1                         2110
#define CCPR7L                        2111
#define CCPR7H                        2112
#define CCP6CON                       2113
#define CCP6M                         2114
#define CCP6M0                        2115
#define CCP6M1                        2116
#define CCP6M2                        2117
#define CCP6M3                        2118
#define CCP6Y                         2119
#define DC6B0                         2120
#define DC6B                          2121
#define DC6B1                         2122
#define CCP6X                         2123
#define CCPR6L                        2124
#define CCPR6H                        2125
#define CCP5CON                       2126
#define CCP5M0                        2127
#define CCP5M                         2128
#define CCP5M1                        2129
#define CCP5M2                        2130
#define CCP5M3                        2131
#define CCP5Y                         2132
#define DC5B0                         2133
#define DC5B                          2134
#define CCP5X                         2135
#define DC5B1                         2136
#define CCPR5L                        2137
#define CCPR5H                        2138
#define CCP4CON                       2139
#define CCP4M                         2140
#define CCP4M0                        2141
#define CCP4M1                        2142
#define CCP4M2                        2143
#define CCP4M3                        2144
#define CCP4Y                         2145
#define DC4B0                         2146
#define DC4B                          2147
#define CCP4X                         2148
#define DC4B1                         2149
#define CCPR4L                        2150
#define CCPR4H                        2151
#define T5GCON                        2152
#define T5GSS                         2153
#define T5GSS0                        2154
#define T5GSS1                        2155
#define T5GVAL                        2156
#define T5GGO_NOT_T5DONE              2157
#define nT5DONE                       2158
#define T5GGO_nT5DONE                 2159
#define NOT_T5DONE                    2160
#define T5GGO                         2161
#define T5GSPM                        2162
#define T5GTM                         2163
#define T5GPOL                        2164
#define TMR5GE                        2165
#define T5CON                         2166
#define TMR5ON                        2167
#define T5CON_RD16                    2168
#define RD165                         2169
#define nT5SYNC                       2170
#define NOT_T5SYNC                    2171
#define SOSCEN5                       2172
#define T5CON_SOSCEN                  2173
#define T5CON_TCKPS                   2174
#define T5CKPS0                       2175
#define T5CKPS1                       2176
#define TMR5CS0                       2177
#define TMR5CS                        2178
#define TMR5CS1                       2179
#define TMR5L                         2180
#define TMR5H                         2181
#define SSP2MSK                       2182
#define SSP2MSK_SSPMSK                2183
#define SSP2MSK_MSK0                  2184
#define SSP2MSK_MSK1                  2185
#define SSP2MSK_MSK2                  2186
#define SSP2MSK_MSK3                  2187
#define SSP2MSK_MSK4                  2188
#define SSP2MSK_MSK5                  2189
#define SSP2MSK_MSK6                  2190
#define SSP2MSK_MSK7                  2191
#define SSP2CON2                      2192
#define SEN2                          2193
#define SSP2CON2_SEN                  2194
#define ADMSK12                       2195
#define SSP2CON2_RSEN                 2196
#define SSP2CON2_ADMSK                2197
#define RSEN2                         2198
#define SSP2CON2_ADMSK1               2199
#define ADMSK22                       2200
#define PEN2                          2201
#define SSP2CON2_PEN                  2202
#define SSP2CON2_ADMSK2               2203
#define ADMSK32                       2204
#define SSP2CON2_RCEN                 2205
#define RCEN2                         2206
