tiborsimon/embedded-tdd-headers/pic/8bit/pic18f85j94_tdd.h
#define TRISC                         3323
#define TRISC0                        3324
#define TRISC1                        3325
#define TRISC2                        3326
#define TRISC3                        3327
#define TRISC4                        3328
#define TRISC5                        3329
#define TRISC6                        3330
#define TRISC7                        3331
#define TRISD                         3332
#define TRISD0                        3333
#define TRISD1                        3334
#define TRISD2                        3335
#define TRISD3                        3336
#define TRISD4                        3337
#define TRISD5                        3338
#define TRISD6                        3339
#define TRISD7                        3340
#define TRISE                         3341
#define TRISE0                        3342
#define TRISE1                        3343
#define TRISE2                        3344
#define TRISE3                        3345
#define TRISE4                        3346
#define TRISE5                        3347
#define TRISE6                        3348
#define TRISE7                        3349
#define TRISF                         3350
#define TRISF2                        3351
#define TRISF3                        3352
#define TRISF4                        3353
#define TRISF5                        3354
#define TRISF6                        3355
#define TRISF7                        3356
#define TRISG                         3357
#define TRISG0                        3358
#define TRISG1                        3359
#define TRISG2                        3360
#define TRISG3                        3361
#define TRISG4                        3362
#define TRISH                         3363
#define TRISH0                        3364
#define TRISH1                        3365
#define TRISH2                        3366
#define TRISH3                        3367
#define TRISH4                        3368
#define TRISH5                        3369
#define TRISH6                        3370
#define TRISH7                        3371
#define TRISJ                         3372
#define TRISJ0                        3373
#define TRISJ1                        3374
#define TRISJ2                        3375
#define TRISJ3                        3376
#define TRISJ4                        3377
#define TRISJ5                        3378
#define TRISJ6                        3379
#define TRISJ7                        3380
#define OSCTUNE                       3381
#define TUN0                          3382
#define TUN                           3383
#define TUN1                          3384
#define TUN2                          3385
#define TUN3                          3386
#define TUN4                          3387
#define TUN5                          3388
#define PSTR1CON                      3389
#define PSTR1CON_STRA                 3390
#define PSTR1CON_STRB                 3391
#define PSTR1CON_STRC                 3392
#define PSTR1CON_STRD                 3393
#define PSTR1CON_STRSYNC              3394
#define PSTR1CON_CMPL0                3395
#define PSTR1CON_CMPL                 3396
#define PSTR1CON_CMPL1                3397
#define PIE1                          3398
#define TMR1IE                        3399
#define TMR2IE                        3400
#define TMR1GIE                       3401
#define SSP1IE                        3402
#define TXIE                          3403
#define TX1IE                         3404
#define RC1IE                         3405
#define ADIE                          3406
#define PSPIE                         3407
#define PIR1                          3408
#define TMR1IF                        3409
#define TMR2IF                        3410
#define TMR1GIF                       3411
#define SSP1IF                        3412
#define TXIF                          3413
#define TX1IF                         3414
#define RC1IF                         3415
#define ADIF                          3416
#define PSPIF                         3417
#define IPR1                          3418
#define TMR1IP                        3419
#define TMR2IP                        3420
#define TMR1GIP                       3421
#define SSP1IP                        3422
#define TX1IP                         3423
#define RC1IP                         3424
#define ADIP                          3425
#define PSPIP                         3426
#define PIE2                          3427
#define TMR3GIE                       3428
#define TMR3IE                        3429
#define HLVDIE                        3430
#define BCL1IE                        3431
#define USBIE                         3432
#define BCL2IE                        3433
#define SSP2IE                        3434
#define CMIE                          3435
#define OSCFIE                        3436
#define PIR2                          3437
#define TMR3GIF                       3438
#define TMR3IF                        3439
#define HLVDIF                        3440
#define LVDIF                         3441
#define BCL1IF                        3442
#define USBIF                         3443
#define BCL2IF                        3444
#define CMIF                          3445
#define SSP2IF                        3446
#define OSCFIF                        3447
#define IPR2                          3448
#define TMR3GIP                       3449
#define TMR3IP                        3450
#define HLVDIP                        3451
#define BCL1IP                        3452
#define USBIP                         3453
#define BCL2IP                        3454
#define CMIP                          3455
#define SSP2IP                        3456
#define OSCFIP                        3457
#define PIE3                          3458
#define RXB0IE                        3459
#define RTCCIE                        3460
#define RXBNIE                        3461
#define CCP1IE                        3462
#define RXB1IE                        3463
#define CCP2IE                        3464
#define TXB0IE                        3465
#define CTMUIE                        3466
#define TXB1IE                        3467
#define TXBNIE                        3468
#define TXB2IE                        3469
#define TX2IE                         3470
#define RC2IE                         3471
#define LCDIE                         3472
#define TMR5GIE                       3473
#define PIR3                          3474
#define RTCCIF                        3475
#define RXBNIF                        3476
#define CCP1IF                        3477
#define CCP2IF                        3478
#define CTMUIF                        3479
#define TXBNIF                        3480
#define TX2IF                         3481
#define RC2IF                         3482
#define LCDIF                         3483
#define TMR5GIF                       3484
#define IPR3                          3485
#define RTCCIP                        3486
#define CCP1IP                        3487
#define RXBNIP                        3488
#define CCP2IP                        3489
#define CTMUIP                        3490
#define TX2IP                         3491
#define TXBNIP                        3492
#define RC2IP                         3493
#define LCDIP                         3494
#define TMR5GIP                       3495
#define PIR6                          3496
#define CMP1IF                        3497
#define CMP2IF                        3498
#define CMP3IF                        3499
#define TX3IF                         3500
#define RC3IF                         3501
#define TX4IF                         3502
#define RC4IF                         3503
#define PSPCON                        3504
#define PSPMODE                       3505
#define IBOV                          3506
#define OBF                           3507
#define IBF                           3508
#define HLVDCON                       3509
#define HLVDL                         3510
#define HLVDL0                        3511
#define HLVDL1                        3512
#define HLVDL2                        3513
#define HLVDL3                        3514
#define HLVDEN                        3515
#define IRVST                         3516
#define BGVST                         3517
#define VDIRMAG                       3518
#define IPR6                          3519
#define CMP1IP                        3520
#define CMP2IP                        3521
#define CMP3IP                        3522
#define TX3IP                         3523
#define RC3IP                         3524
#define TX4IP                         3525
#define RC4IP                         3526
#define T1GCON                        3527
#define T1GSS0                        3528
#define T1GSS                         3529
#define T1GSS1                        3530
#define T1GVAL                        3531
#define T1GGO_nT1DONE                 3532
#define nT1DONE                       3533
#define T1GGO_NOT_T1DONE              3534
#define NOT_T1DONE                    3535
#define T1GGO                         3536
#define T1GSPM                        3537
#define T1GTM                         3538
#define T1GPOL                        3539
#define TMR1GE                        3540
#define RCSTA1                        3541
#define RCD8                          3542
#define RCSTA1_RX9D                   3543
#define RCSTA1_OERR                   3544
#define RCSTA1_FERR                   3545
#define RCSTA1_ADDEN                  3546
#define ADEN                          3547
#define RCSTA1_CREN                   3548
#define RCSTA1_SREN                   3549
#define SRENA                         3550
#define RC8_9                         3551
#define RC9                           3552
#define RCSTA1_RX9                    3553
#define RCSTA1_SPEN                   3554
#define TXSTA1                        3555
#define TX9D1                         3556
#define TXSTA1_TX9D                   3557
#define TXD8                          3558
#define TRMT1                         3559
#define TXSTA1_TRMT                   3560
#define BRGH1                         3561
#define TXSTA1_BRGH                   3562
#define TXSTA1_SENDB                  3563
#define SENDB1                        3564
#define TXSTA1_SYNC                   3565
#define SYNC1                         3566
#define TXEN1                         3567
#define TXSTA1_TXEN                   3568
#define TX91                          3569
#define TX8_9                         3570
#define TXSTA1_TX9                    3571
#define TXSTA1_CSRC                   3572
#define CSRC1                         3573
#define TXREG1                        3574
#define RCREG1                        3575
#define SPBRG1_BRG0                   3576
#define SPBRG1                        3577
#define SPBRG1_BRG1                   3578
#define SPBRG1_BRG2                   3579
#define SPBRG1_BRG3                   3580
#define SPBRG1_BRG4                   3581
#define SPBRG1_BRG5                   3582
#define SPBRG1_BRG6                   3583
#define SPBRG1_BRG7                   3584
#define T3GCON                        3585
#define T3GSS0                        3586
#define T3GSS                         3587
#define T3GSS1                        3588
#define T3GVAL                        3589
#define T3GGO                         3590
#define NOT_T3DONE                    3591
#define nT3DONE                       3592
#define T3GGO_nT3DONE                 3593
#define T3GGO_NOT_T3DONE              3594
#define T3GSPM                        3595
#define T3GTM                         3596
#define T3GPOL                        3597
#define TMR3GE                        3598
#define T3CON                         3599
#define TMR3ON                        3600
#define T3CON_RD16                    3601
#define nT3SYNC                       3602
#define NOT_T3SYNC                    3603
#define SOSCEN3                       3604
#define T3CON_SOSCEN                  3605
#define T3CKPS0                       3606
#define T3CON_TCKPS                   3607
#define T3CKPS1                       3608
#define TMR3CS0                       3609
#define TMR3CS                        3610
#define TMR3CS1                       3611
#define T3RD16                        3612
#define RD163                         3613
#define TMR3L                         3614
#define TMR3H                         3615
#define PIE4                          3616
#define ECCP3IE                       3617
#define CCP4IE                        3618
#define CCP5IE                        3619
#define CCP6IE                        3620
#define CCP7IE                        3621
#define CCP8IE                        3622
#define CCP9IE                        3623
#define CCP10IE                       3624
#define PIR4                          3625
#define ECCP3IF                       3626
#define CCP4IF                        3627
#define CCP5IF                        3628
#define CCP6IF                        3629
#define CCP7IF                        3630
#define CCP8IF                        3631
#define CCP9IF                        3632
#define CCP10IF                       3633
#define IPR4                          3634
#define ECCP3IP                       3635
#define CCIP3IP                       3636
#define CCP4IP                        3637
#define CCP5IP                        3638
#define CCP6IP                        3639
#define CCP7IP                        3640
#define CCP8IP                        3641
#define CCP9IP                        3642
#define CCP10IP                       3643
#define PIE5                          3644
#define TMR4IE                        3645
#define TMR5IE                        3646
#define TMR6IE                        3647
#define TMR8IE                        3648
#define ACTLOCKIE                     3649
#define ACTORSIE                      3650
#define PIR5                          3651
#define TMR4IF                        3652
#define TMR5IF                        3653
#define TMR6IF                        3654
#define TMR8IF                        3655
#define ACTLOCKIF                     3656
#define ACTORSIF                      3657
#define CCP1CON                       3658
#define CCP1M0                        3659
#define CCP1M                         3660
#define CCP1M1                        3661
#define CCP1M2                        3662
#define CCP1M3                        3663
#define CCP1Y                         3664
#define DC1B                          3665
#define DC1B0                         3666
#define CCP1X                         3667
#define DC1B1                         3668
#define P1M                           3669
#define P1M0                          3670
#define P1M1                          3671
#define CCPR1L                        3672
#define CCPR1H                        3673
#define ECCP1DEL                      3674
#define P1DC                          3675
#define P1DC0                         3676
#define P1DC1                         3677
#define P1DC2                         3678
#define P1DC3                         3679
#define P1DC4                         3680
#define P1DC5                         3681
#define P1DC6                         3682
#define P1RSEN                        3683
#define PSS1BD0                       3684
#define PSS1BD                        3685
#define PSS1BD1                       3686
#define PSS1AC                        3687
#define PSS1AC0                       3688
#define PSS1AC1                       3689
#define ECCP1AS                       3690
#define ECCP1AS0                      3691
#define ECCP1AS1                      3692
#define ECCP1AS2                      3693
#define ECCP1ASE                      3694
#define CVRCONL                       3695
#define CVRNSS                        3696
#define CVRPSS0                       3697
#define CVRPSS                        3698
#define CVRPSS1                       3699
#define CVROE                         3700
#define CVREN                         3701
#define CVRCONH                       3702
#define CVR                           3703
#define CVR0                          3704
#define CVR1                          3705
#define CVR2                          3706
#define CVR3                          3707
#define CVR4                          3708
#define ADCON1L                       3709
#define DONE                          3710
#define SAMP                          3711
#define ASAM                          3712
#define SSRC0                         3713
#define SSRC                          3714
#define SSRC1                         3715
#define SSRC2                         3716
#define SSRC3                         3717
#define ADCON1H                       3718
#define FORM0                         3719
#define FORM                          3720
#define FORM1                         3721
#define MODE12                        3722
#define ADON                          3723
#define ADCBUF0L                      3724
#define ADCBUF0H                      3725
#define CMSTAT                        3726
#define C1OUT                         3727
#define C2OUT                         3728
#define C3OUT                         3729
#define SSP1CON2                      3730
#define SEN1                          3731
#define SSP1CON2_SEN                  3732
#define ADMSK11                       3733
#define SSP1CON2_RSEN                 3734
#define RSEN1                         3735
#define SSP1CON2_ADMSK1               3736
#define SSP1CON2_ADMSK                3737
#define SSP1CON2_PEN                  3738
#define ADMSK21                       3739
#define PEN1                          3740
#define SSP1CON2_ADMSK2               3741
#define ADMSK31                       3742
#define RCEN1                         3743
#define SSP1CON2_RCEN                 3744
#define SSP1CON2_ADMSK3               3745
#define SSP1CON2_ACKEN                3746
#define ACKEN1                        3747
#define ADMSK41                       3748
#define SSP1CON2_ADMSK4               3749
#define ACKDT1                        3750
#define ADMSK51                       3751
#define SSP1CON2_ACKDT                3752
#define SSP1CON2_ADMSK5               3753
#define SSP1CON2_ACKSTAT              3754
#define ACKSTAT1                      3755
#define GCEN1                         3756
#define SSP1CON2_GCEN                 3757
#define SSP1CON1                      3758
#define SSP1CON1_SSPM0                3759
#define SSPM01                        3760
#define SSP1CON1_SSPM                 3761
#define SSP1CON1_SSPM1                3762
#define SSPM11                        3763
#define SSP1CON1_SSPM2                3764
#define SSPM21                        3765
#define SSPM31                        3766
#define SSP1CON1_SSPM3                3767
#define SSP1CON1_CKP                  3768
#define CKP1                          3769
#define SSPEN1                        3770
#define SSP1CON1_SSPEN                3771
#define SSPOV1                        3772
#define SSP1CON1_SSPOV                3773
#define WCOL1                         3774
#define SSP1CON1_WCOL                 3775
#define SSP1STAT                      3776
#define BF1                           3777
#define SSP1STAT_BF                   3778
#define UA1                           3779
#define SSP1STAT_UA                   3780
#define SSP1STAT_R_NOT_W              3781
#define RW1                           3782
#define SSP1STAT_nW                   3783
#define RW                            3784
#define SSP1STAT_READ_WRITE           3785
#define SSP1STAT_nWRITE               3786
#define SSP1STAT_I2C_READ             3787
#define SSP1STAT_R_W                  3788
#define R                             3789
#define SSP1STAT_NOT_WRITE            3790
#define SSP1STAT_R_nW                 3791
#define SSP1STAT_S                    3792
#define START                         3793
#define START1                        3794
#define SSP1STAT_I2C_START            3795
#define STOP                          3796
#define SSP1STAT_P                    3797
#define STOP1                         3798
#define SSP1STAT_I2C_STOP             3799
#define SSP1STAT_D_NOT_A              3800
#define SSP1STAT_D_A                  3801
#define SSP1STAT_D_nA                 3802
#define SSP1STAT_NOT_ADDRESS          3803
#define SSP1STAT_DATA_ADDRESS         3804
#define SSP1STAT_nA                   3805
#define D                             3806
#define DA1                           3807
#define DA                            3808
#define SSP1STAT_nADDRESS             3809
#define SSP1STAT_I2C_DAT              3810
#define SSP1STAT_CKE                  3811
#define CKE1                          3812
#define SSP1STAT_SMP                  3813
#define SMP1                          3814
#define SSP1ADD                       3815
#define SSP1ADD_SSPADD                3816
#define SSP1ADD_MSK0                  3817
#define MSK01                         3818
#define SSP1ADD_MSK1                  3819
#define MSK11                         3820
#define SSP1ADD_MSK2                  3821
#define MSK21                         3822
#define MSK31                         3823
#define SSP1ADD_MSK3                  3824
#define SSP1ADD_MSK4                  3825
#define MSK41                         3826
#define SSP1ADD_MSK5                  3827
#define MSK51                         3828
#define MSK61                         3829
#define SSP1ADD_MSK6                  3830
#define SSP1ADD_MSK7                  3831
#define MSK71                         3832
#define SSP1BUF                       3833
#define SSP1BUF_SSPBUF                3834
#define T2CON                         3835
#define T2CKPS0                       3836
#define T2CKPS                        3837
#define T2CKPS1                       3838
#define TMR2ON                        3839
#define T2OUTPS0                      3840
#define T2OUTPS                       3841
#define T2OUTPS1                      3842
#define T2OUTPS2                      3843
#define T2OUTPS3                      3844
#define PR2                           3845
#define TMR2                          3846
#define T1CON                         3847
#define TMR1ON                        3848
#define T1CON_RD16                    3849
#define NOT_T1SYNC                    3850
#define nT1SYNC                       3851
#define T1CON_SOSCEN                  3852
#define T1OSCEN                       3853
#define T1CKPS0                       3854
#define T1CON_TCKPS                   3855
#define T1CKPS1                       3856
#define TMR1CS0                       3857
#define TMR1CS                        3858
#define T1RD16                        3859
#define TMR1CS1                       3860
#define TMR1L                         3861
#define TMR1H                         3862
#define RCON                          3863
#define RCON_BOR                      3864
#define NOT_BOR                       3865
#define nBOR                          3866
#define POR                           3867
#define nPOR                          3868
#define NOT_POR                       3869
#define PD                            3870
#define nPD                           3871
#define NOT_PD                        3872
#define nTO                           3873
#define TO                            3874
#define NOT_TO                        3875
#define nRI                           3876
#define NOT_RI                        3877
#define RI                            3878
#define NOT_CM                        3879
#define RCON_CM                       3880
